# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

# JMS 2.0
MainController.1=Haszn\u00e1lat: java -jar com.ibm.mq.allclient.jar [-traceControl <options> | -version | -jmsversion | -javaversion]  -traceControl <options> megh\u00edvja a dinamikus nyomk\u00f6vet\u00e9s-vez\u00e9rl\u0151 funkci\u00f3t a  megadott param\u00e9terekkel -version megjelen\u00edti az MQ JMS oszt\u00e1lyok \u00e9s MQ Java oszt\u00e1lyok v\u00e1ltozataira vonatkoz\u00f3 inform\u00e1ci\u00f3kat (alap\u00e9rtelmezett be\u00e1ll\u00edt\u00e1s) -jmsversion megjelen\u00edti az MQ JMS oszt\u00e1lyok v\u00e1ltozat\u00e1ra vonatkoz\u00f3 inform\u00e1ci\u00f3kat -javaversion az MQ Java oszt\u00e1lyok (alap\u00e9rtelmezett be\u00e1ll\u00edt\u00e1s) v\u00e1ltozatinform\u00e1ci\u00f3it jelen\u00edti meg   -help | -h | -? | -usage megjelen\u00edti ezt az \u00fczenetet 
MainController.2=Nincsenek param\u00e9terek megadva. Minden verzi\u00f3inform\u00e1ci\u00f3 megjelenik. A haszn\u00e1lati inform\u00e1ci\u00f3k megtekint\u00e9s\u00e9hez haszn\u00e1lja a k\u00f6vetkez\u0151t: java -jar com.ibm.mq.allclient.jar -help.
MainController.8=\u00c9rv\u00e9nytelen parancssori param\u00e9ter: ''{0}''. A haszn\u00e1lati inform\u00e1ci\u00f3k megtekint\u00e9s\u00e9hez haszn\u00e1lja a k\u00f6vetkez\u0151t: java -jar com.ibm.mq.allclient.jar -help.

# JMS 3.0/Jakarta
JakartaMainController.1=Haszn\u00e1lat: java -jar com.ibm.mq.jakarta.client.jar [- traceControl <options> | -jmsversion | -jmsadmin] -traceControl <options>  megh\u00edvja a dinamikus nyomk\u00f6vet\u00e9s-vez\u00e9rl\u0151 funkci\u00f3t a megadott param\u00e9terekkel    -jmsversion megjelen\u00edti az MQ Jakarta \u00fczenetkezel\u00e9si oszt\u00e1lyokra vonatkoz\u00f3 v\u00e1ltozatinform\u00e1ci\u00f3kat (alap\u00e9rtelmezett be\u00e1ll\u00edt\u00e1s) -jmsadmin megh\u00edvja az MQ  Jakarta \u00fczenetkezel\u00e9si oszt\u00e1lyok JNDI adminisztr\u00e1ci\u00f3s eszk\u00f6z\u00e9t a megadott param\u00e9terekkel  -help | -h | -? | -usage megjelen\u00edti ezt az \u00fczenetet 
JakartaMainController.2=Nincsenek megadva param\u00e9terek.
JakartaMainController.8=\u00c9rv\u00e9nytelen parancssori param\u00e9ter: ''{0}''. A haszn\u00e1lati inform\u00e1ci\u00f3k\u00e9rt haszn\u00e1lja a java -jar com.ibm.mq.jakarta.client.jar -help parancsot.