# @(#) MQMBID sn=p932-L230207 su=_mMBuZqcAEe2pWoFAaNK_Tg pn=com.ibm.msg.client.commonservices/src/com/ibm/msg/client/commonservices/resources/JMSCS_MessageResourceBundle_pl.properties
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2022"                                              
#   crc="830812269" >                                              
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2022 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = W\u0142a\u015bciwo\u015bci z pliku w\u0142a\u015bciwo\u015bci {0} nie mog\u0142y zosta\u0107 za\u0142adowane z powodu wyst\u0105pienia wyj\u0105tku IOException.
JMSCS0001.useraction = Sprawd\u017a, czy plik w\u0142a\u015bciwo\u015bci istnieje i ma odpowiednie uprawnienia.
JMSCS0002 = Nie mo\u017cna zako\u0144czy\u0107 wywo\u0142ania, poniewa\u017c nie zosta\u0142y zainicjowane us\u0142ugi CommonServices.
JMSCS0002.explanation = Us\u0142ugi CommonServices stanowi\u0105 komponent wewn\u0119trzny i nale\u017cy je zainicjowa\u0107 podczas uruchamiania. Ta czynno\u015b\u0107 si\u0119 jednak nie powiod\u0142a.
JMSCS0002.useraction = Sprawd\u017a, czy konfiguracja \u015bcie\u017cki klasy i instalacji jest poprawna.
JMSCS0003 = Nie znaleziono komponentu us\u0142ug CommonServices.
JMSCS0003.explanation = Us\u0142ugi CommonServices stanowi\u0105 komponent wewn\u0119trzny i nie zosta\u0142y odnalezione.
JMSCS0003.useraction = Sprawd\u017a, czy konfiguracja \u015bcie\u017cki klasy i instalacji jest poprawna.
JMSCS0004 = Nie znaleziono komponentu dostawcy przesy\u0142ania komunikat\u00f3w.
JMSCS0004.explanation = Zg\u0142oszono \u017c\u0105danie u\u017cycia dostawcy przesy\u0142ania komunikat\u00f3w, kt\u00f3ry nie wyst\u0119puje w bie\u017c\u0105cej konfiguracji.
JMSCS0004.useraction = Sprawd\u017a, czy plik JAR zawieraj\u0105cy dostawc\u0119 przesy\u0142ania komunikat\u00f3w wyst\u0119puje w \u015bcie\u017cce klasy lub zosta\u0142 zarejestrowany.
JMSCS0005 = Mened\u017cer komponent\u00f3w nie m\u00f3g\u0142 znale\u017a\u0107 komponentu.
JMSCS0005.explanation = Zg\u0142oszono \u017c\u0105danie u\u017cycia komponentu, kt\u00f3ry nie wyst\u0119puje w bie\u017c\u0105cej konfiguracji.
JMSCS0005.useraction = Sprawd\u017a, czy plik JAR zawieraj\u0105cy komponent wyst\u0119puje w \u015bcie\u017cce klasy lub zosta\u0142 zarejestrowany.
JMSCS0006 = Wyst\u0105pi\u0142 problem wewn\u0119trzny. Informacje diagnostyczne dotycz\u0105ce us\u0142ugi zosta\u0142y zapisane w pliku {0}. Zako\u0144cz dzia\u0142anie aplikacji, poniewa\u017c produkt ma niesp\u00f3jny stan wewn\u0119trzny.
JMSCS0006.useraction = Zapisz wszystkie wygenerowane pliki wyj\u015bciowe i skorzystaj z serwisu dzia\u0142u wsparcia dla produktu WMQ (http://www.ibm.com/software/integration/wmq/support/) lub programu IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) w celu sprawdzenia, czy rozwi\u0105zanie jest ju\u017c dost\u0119pne.  Je\u015bli znalezienie zgodnego przypadku nie jest mo\u017cliwe, skontaktuj si\u0119 z dzia\u0142em wsparcia IBM.
JMSCS0007 = WYJA\u015aNIENIE:
JMSCS0008 = DZIA\u0141ANIE:

JMSCS0009 = W\u0142a\u015bciwo\u015bci systemowe nie zosta\u0142y za\u0142adowane z powodu wyj\u0105tku AccessControlException.
JMSCS0009.explanation = Obiekt PropertyStore nie m\u00f3g\u0142 wykona\u0107 zapytania o w\u0142a\u015bciwo\u015bci systemowe, poniewa\u017c nie jest to dozwolone przez strategi\u0119 bezpiecze\u0144stwa.
JMSCS0009.useraction = Zmodyfikuj strategi\u0119 bezpiecze\u0144stwa, aby umo\u017cliwi\u0107 odczyt w\u0142a\u015bciwo\u015bci systemowych.

JMSCS0010 = Us\u0142ugi wsp\u00f3lne klienta przesy\u0142ania komunikat\u00f3w IBM nie mog\u0105 znale\u017a\u0107 lub zainicjowa\u0107 komponentu z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku: {0}.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Komunikat
JMSCS0012 = Klasa
JMSCS0013 = Stos
JMSCS0014 = Spowodowany przez [{0}] --> Komunikat
JMSCS0015 = Obiekt wsp\u00f3lny znajduje si\u0119 w niepoprawnym stanie

JMSCS0016 = Operacja mened\u017cera komend nie powiod\u0142a si\u0119.

JMSCS0017 = Wczytano plik konfiguracyjny us\u0142ug CommonServices z {0}
JMSCS0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Podano nieznan\u0105 nazw\u0119 w\u0142a\u015bciwo\u015bci {0}
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = W\u0142a\u015bciwo\u015b\u0107 {0} zosta\u0142a ju\u017c ustawiona przez {1}. Nie mo\u017cna jej aktualizowa\u0107.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = Nie mo\u017cna przekszta\u0142ci\u0107 klasy do postaci szeregowej ani z postaci szeregowej, poniewa\u017c nie zosta\u0142a ona umieszczona na li\u015bcie zaakceptowanych {0}.
JMSCS0020.inserts = XMSC_ALLOWLIST

JMSCS0021 = Nie mo\u017cna otworzy\u0107 pliku listy zaakceptowanych {0}
JMSCS0021.inserts = XMSC_ALLOWLIST

JMSCS0022 = Plik listy zaakceptowanych {0} ju\u017c istnieje i nie mo\u017cna go nadpisa\u0107
JMSCS0022.inserts = XMSC_ALLOWLIST

JMSCS0023 = Lista zaakceptowanych {0} zawiera niepoprawny wpis
JMSCS0023.inserts = XMSC_ALLOWLIST

JMSCS0024 = Nie mo\u017cna zapisa\u0107 pliku listy zaakceptowanych

JMSCS0025 = W\u0142\u0105czono w\u0142a\u015bciwo\u015b\u0107 wymuszenia (ENFORCEMENT) listy zaakceptowanych - plik listy zaakceptowanych {0} jest u\u017cywany do sprawdzania poprawno\u015bci operacji przekszta\u0142cania do i z postaci szeregowej obiektu ObjectMessage - drzewo listy zaakceptowanych to {1}
JMSCS0025.inserts = XMSC_ALLOWLIST,XMSC_ALLOWLIST_CONTENTS

JMSCS0026 = W\u0142\u0105czono w\u0142a\u015bciwo\u015b\u0107 wykrywania (DISCOVERY) listy zaakceptowanych - plik listy zaakceptowanych {0} jest u\u017cywany do rejestrowania operacji przekszta\u0142cania do i z postaci szeregowej obiektu ObjectMessage
JMSCS0026.inserts = XMSC_ALLOWLIST

JMSCS0027 = W\u0142\u0105czono w\u0142a\u015bciwo\u015b\u0107 egzekwowania (ENFORCEMENT) listy zaakceptowanych - lista zaakceptowanych {0} jest u\u017cywana do sprawdzania poprawno\u015bci operacji przekszta\u0142cania do i z postaci szeregowej obiektu ObjectMessage
JMSCS0027.inserts = XMSC_ALLOWLIST

JMSCS0028 = Za\u017c\u0105dano w\u0142a\u015bciwo\u015bci wykrywania (DISCOVERY) listy zaakceptowanych, ale nazwa pliku listy zaakceptowanych {0} nie jest identyfikatorem URI
JMSCS0028.inserts = XMSC_ALLOWLIST

JMSCS0029 = Nie w\u0142\u0105czono funkcjonalno\u015bci listy zaakceptowanych - nie ustawiono w\u0142a\u015bciwo\u015bci lub uprawnienia zabezpiecze\u0144 uniemo\u017cliwiaj\u0105 ich odczytanie

JMSCS0030 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie ma uprawnie\u0144 do zapisywania w pliku \u015bledzenia ''{0}'' w katalogu ''{1}''
JMSCS0030.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME 

JMSCS0031 = Wyst\u0105pi\u0142 wyj\u0105tek podczas pr\u00f3by zapisania pliku \u015bledzenia ''{0}'' w katalogu \u015bledzenia ''{1}''. Wyj\u0105tek: ''{2}''
JMSCS0031.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME, XMSC_EXCEPTION

JMSCS0032 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie m\u00f3g\u0142 zainicjowa\u0107 pliku \u015bledzenia ''{0}''z powodu nast\u0119puj\u0105cego wyj\u0105tku: ''{1}''. Dane \u015bledzenia zostan\u0105 zapisane w pliku System.Err. 
JMSCS0032.inserts = XMSC_TRACE_FILE_NAME, XMSC_EXCEPTION

JMSCS0033 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie mo\u017ce utworzy\u0107 danych \u015bledzenia w domy\u015blnym po\u0142o\u017ceniu systemowym ''{0}''
JMSCS0033.inserts = XMSC_TRACE_FILE_NAME

JMSCS0034 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie m\u00f3g\u0142 utworzy\u0107 danych \u015bledzenia w podanym po\u0142o\u017ceniu ''{0}''
JMSCS0034.inserts = XMSC_TRACE_FILE_NAME

JMSCS0035 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie m\u00f3g\u0142 utworzy\u0107 danych \u015bledzenia w bie\u017c\u0105cym po\u0142o\u017ceniu ''{0}''
JMSCS0035.inserts = XMSC_TRACE_FILE_NAME

JMSCS0036 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie przeanalizowa\u0142 \u0142a\u0144cucha wyszukiwania \u015bledzenia ''{0}''
JMSCS0036.inserts = XMSC_SEARCH_STRING

JMSCS0037 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie m\u00f3g\u0142 utworzy\u0107 instancji obiektu TraceHandler ''{0}''
JMSCS0037.inserts = XMSC_HANDLER_NAME

JMSCS0038 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie m\u00f3g\u0142 utworzy\u0107 instancji obiektu TraceFormatter ''{0}''
JMSCS0038.inserts = XMSC_FORMATTER_NAME

JMSCS0039 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ nie m\u00f3g\u0142 zapisa\u0107 danych FFDC ''{0}''
JMSCS0039.inserts = XMSC_FDC_NAME

JMSCS0040 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ przesy\u0142a dane \u015bledzenia ''{0}''
JMSCS0040.inserts = XMSC_TRACE_FILE_NAME

JMSCS0041 = Mechanizm \u015bledzenia klienta przesy\u0142ania komunikat\u00f3w produktu IBM MQ przesy\u0142a dane \u015bledzenia konsoli

JMSCS0042 = W\u0142a\u015bciwo\u015b\u0107 ''{0}'' ma warto\u015b\u0107 ''{1}''
JMSCS0042.inserts = XMSC_PROPERTY_NAME, XMSC_PROPERTY_VALUE 

JMSCS0043 = Kolejkowanie ponownego \u0142\u0105czenia nadrz\u0119dnego hconn ''{0}'' z mened\u017cerem kolejek ''{1}''
JMSCS0043.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER

JMSCS0044 = Inicjowanie ponownego \u0142\u0105czenia nadrz\u0119dnego hconn ''{0}'' z mened\u017cerem kolejek ''{1}''
JMSCS0044.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER
JMSCS0044.explanation = Ponowne nawi\u0105zywanie po\u0142\u0105czenia zosta\u0142o uruchomione ze wzgl\u0119du na \u017c\u0105danie z jednolitego klastra (niepusta nazwa mened\u017cera kolejek) lub w wyniku niepowodzenia po\u0142\u0105czenia.
JMSCS0044.useraction = Nie jest wymagane \u017cadne dzia\u0142anie.

JMSCS0045 = Przerywanie ponownego \u0142\u0105czenia nadrz\u0119dnego hconn ''{0}''
JMSCS0045.inserts = XMSC_HCONN

JMSCS0046 = Zmiana harmonogramu ponownego \u0142\u0105czenia nadrz\u0119dnego hconn ''{0}''
JMSCS0046.inserts = XMSC_HCONN
JMSCS0046.explanation = Ponowne nawi\u0105zanie po\u0142\u0105czenia si\u0119 nie powiod\u0142o i zostanie ponowione p\u00f3\u017aniej. 
JMSCS0046.useraction = Nie jest wymagane \u017cadne dzia\u0142anie.

JMSCS0047 = Uko\u0144czono ponowne \u0142\u0105czenie nadrz\u0119dnego hconn ''{0}''
JMSCS0047.inserts = XMSC_HCONN

JMSCS0048 = Inicjowanie ponownego \u0142\u0105czenia podrz\u0119dnego hconn ''{0}''
JMSCS0048.inserts = XMSC_HCONN

JMSCS0049 = Nie powiod\u0142o si\u0119 ponowne \u0142\u0105czenie podrz\u0119dnego hconn ''{0}''
JMSCS0049.inserts = XMSC_HCONN

JMSCS0050 = Uko\u0144czono ponowne \u0142\u0105czenie podrz\u0119dnego hconn ''{0}''
JMSCS0050.inserts = XMSC_HCONN

JMSCS0051 = Nie mo\u017cna ju\u017c po\u0142\u0105czy\u0107 si\u0119 z nadrz\u0119dnym hconn ''{0}''
JMSCS0051.inserts = XMSC_HCONN

JMSCS0052 = Up\u0142yn\u0105\u0142 czas ponownego \u0142\u0105czenia nadrz\u0119dnego hconn ''{0}''
JMSCS0052.inserts = XMSC_HCONN

JMSCS0053 = Czas ponownego \u0142\u0105czenia (milisekundy): ''{0}''
JMSCS0053.inserts = XMSC_RECONNECTION_TIMES

JMSCS0054 = \u017b\u0105danie ponownego \u0142\u0105czenia nadrz\u0119dnego hconn ''{0}'' jest ignorowane, gdy\u017c hconn nie jest gotowy do ponownego po\u0142\u0105czenia
JMSCS0054.inserts = XMSC_HCONN

