# @(#) MQMBID sn=p932-L230207 su=_mMBuZqcAEe2pWoFAaNK_Tg pn=com.ibm.msg.client.commonservices/src/com/ibm/msg/client/commonservices/resources/JMSCS_MessageResourceBundle_fr.properties
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2022"                                              
#   crc="830812269" >                                              
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2022 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Les propri\u00e9t\u00e9s du fichier de propri\u00e9t\u00e9s ''{0}'' n''ont pas pu \u00eatre charg\u00e9es en raison d''une exception d''E-S.
JMSCS0001.useraction = V\u00e9rifiez que le fichier de propri\u00e9t\u00e9s existe et qu'il dispose des droits appropri\u00e9s.
JMSCS0002 = L'appel n'a pas pu \u00eatre effectu\u00e9 car CommonServices n'a pas \u00e9t\u00e9 initialis\u00e9.
JMSCS0002.explanation = CommonServices est un composant interne et doit \u00eatre initialis\u00e9 au d\u00e9marrage, mais il a \u00e9chou\u00e9.
JMSCS0002.useraction = V\u00e9rifiez que l'installation et la configuration du chemin d'acc\u00e8s aux classes sont corrects.
JMSCS0003 = Un composant CommonServices est introuvable.
JMSCS0003.explanation = CommonServices est un composant interne et il est introuvable.
JMSCS0003.useraction = V\u00e9rifiez que l'installation et la configuration du chemin d'acc\u00e8s aux classes sont corrects.
JMSCS0004 = Un composant Fournisseur de messagerie est introuvable.
JMSCS0004.explanation = Demande d'utilisation d'un fournisseur de messagerie qui ne se trouve pas dans la configuration actuelle.
JMSCS0004.useraction = V\u00e9rifiez que le fichier JAR contenant le fournisseur de messagerie est pr\u00e9sent dans le chemin d'acc\u00e8s aux classes ou qu'il a \u00e9t\u00e9 enregistr\u00e9.
JMSCS0005 = Un composant n'a pas pu \u00eatre d\u00e9tect\u00e9 par le gestionnaire de composants.
JMSCS0005.explanation = Demande d'utilisation d'un composant qui ne se trouve pas dans la configuration actuelle.
JMSCS0005.useraction = V\u00e9rifiez que le fichier JAR contenant le composant est pr\u00e9sent dans le chemin d'acc\u00e8s aux classes ou qu'il a \u00e9t\u00e9 enregistr\u00e9.
JMSCS0006 = Un incident interne s''est produit. Les informations de diagnostic du service ont \u00e9t\u00e9 enregistr\u00e9es dans ''{0}''. Arr\u00eatez l''application car le produit est dans un \u00e9tat interne incoh\u00e9rent.
JMSCS0006.useraction = Sauvegardez les fichiers de sortie g\u00e9n\u00e9r\u00e9s et utilisez le site de support de WMQ (http://www.ibm.com/software/integration/wmq/support) ou IBM Support Assistant (ISA) (http://www.ibm.com/software/support/isa/) pour v\u00e9rifier si une solution est d\u00e9j\u00e0 disponible.  Si vous n'en trouvez pas, adressez-vous \u00e0 votre service d'assistance IBM.
JMSCS0007 = EXPLICATION :
JMSCS0008 = ACTION :

JMSCS0009 = Les propri\u00e9t\u00e9 syst\u00e8me n'ont pas pu \u00eatre charg\u00e9es en raison d'une exception de contr\u00f4le d'acc\u00e8s.
JMSCS0009.explanation = Le magasin de propri\u00e9t\u00e9s n'a pas pu interroger les propri\u00e9t\u00e9s syst\u00e8me car la r\u00e8gle de s\u00e9curit\u00e9 ne le permet pas.
JMSCS0009.useraction = Modifiez la r\u00e8gle de s\u00e9curit\u00e9 pour que les propri\u00e9t\u00e9s syst\u00e8me puissent \u00eatre lues.

JMSCS0010 = Les services communs du client de messagerie IBM ne sont pas parvenus \u00e0 localiser ou \u00e0 initialiser un composant en raison de l''exception ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Message
JMSCS0012 = Classe
JMSCS0013 = Pile
JMSCS0014 = Provoqu\u00e9 par [{0}] --> Message
JMSCS0015 = Etat de l'objet commun non valide

JMSCS0016 = Echec de l'op\u00e9ration du gestionnaire de commandes.

JMSCS0017 = Fichier de configuration CommonServices lu \u00e0 partir de ''{0}''
JMSCS0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Nom de propri\u00e9t\u00e9 inconnu ''{0}'' fourni
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = La propri\u00e9t\u00e9 ''{0}'' a d\u00e9j\u00e0 \u00e9t\u00e9 d\u00e9finie par ''{1}''. Elle ne peut pas \u00eatre mise \u00e0 jour.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = Il se peut que la classe ne soit pas s\u00e9rialis\u00e9e ou d\u00e9s\u00e9rialis\u00e9e car elle n''a pas \u00e9t\u00e9 incluse dans la liste autoris\u00e9e ''{0}''.
JMSCS0020.inserts = XMSC_ALLOWLIST

JMSCS0021 = Le fichier de liste autoris\u00e9e ''{0}'' ne peut pas \u00eatre ouvert
JMSCS0021.inserts = XMSC_ALLOWLIST

JMSCS0022 = Le fichier de liste autoris\u00e9e ''{0}'' existe d\u00e9j\u00e0 et ne peut pas \u00eatre \u00e9cras\u00e9
JMSCS0022.inserts = XMSC_ALLOWLIST

JMSCS0023 = La liste autoris\u00e9e ''{0}'' comporte une entr\u00e9e non valide
JMSCS0023.inserts = XMSC_ALLOWLIST

JMSCS0024 = Le fichier de liste autoris\u00e9e n'a pas pu \u00eatre \u00e9crit

JMSCS0025 = APPLICATION de la liste autoris\u00e9e activ\u00e9e ; le fichier de liste autoris\u00e9e ''{0}'' est utilis\u00e9 pour valider les op\u00e9rations de s\u00e9rialisation et de d\u00e9s\u00e9rialisation des messages d''objet. L''arborescence de la liste autoris\u00e9e est la suivante : ''{1}''
JMSCS0025.inserts = XMSC_ALLOWLIST,XMSC_ALLOWLIST_CONTENTS

JMSCS0026 = RECONNAISSANCE de la liste autoris\u00e9e activ\u00e9e ; le fichier de liste autoris\u00e9e ''{0}'' est utilis\u00e9 pour enregistrer les op\u00e9rations de s\u00e9rialisation et de d\u00e9s\u00e9rialisation des messages d''objet
JMSCS0026.inserts = XMSC_ALLOWLIST

JMSCS0027 = APPLICATION de la liste autoris\u00e9e activ\u00e9e ; la liste autoris\u00e9e ''{0}'' est utilis\u00e9e pour valider les op\u00e9rations de s\u00e9rialisation et de d\u00e9s\u00e9rialisation des messages d''objet
JMSCS0027.inserts = XMSC_ALLOWLIST

JMSCS0028 = RECONNAISSANCE de la liste autoris\u00e9e demand\u00e9e, mais le nom de fichier de liste autoris\u00e9e ''{0}'' ne correspond pas \u00e0 un identificateur URI de fichier
JMSCS0028.inserts = XMSC_ALLOWLIST

JMSCS0029 = Aucune fonctionnalit\u00e9 de liste autoris\u00e9e activ\u00e9e ; les propri\u00e9t\u00e9s n'ont pas \u00e9t\u00e9 d\u00e9finies ou les droits de s\u00e9curit\u00e9 en emp\u00eachent la lecture

JMSCS0030 = Le m\u00e9canisme de trace du client de messagerie IBM MQ ne poss\u00e8de pas le droit permettant d''\u00e9crire dans le fichier de trace ''{0}'' dans le r\u00e9pertoire ''{1}''
JMSCS0030.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME 

JMSCS0031 = Une exception est survenue lors de la tentative d''\u00e9criture dans le fichier de trace ''{0}'' dans le r\u00e9pertoire de trace ''{1}''. L''exception est la suivante : ''{2}''
JMSCS0031.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME, XMSC_EXCEPTION

JMSCS0032 = Le m\u00e9canisme de trace du client de messagerie IBM MQ ne peut pas initialiser le fichier de trace ''{0}'' en raison de l''exception ''{1}''. La trace sera \u00e9crite dans System.Err. 
JMSCS0032.inserts = XMSC_TRACE_FILE_NAME, XMSC_EXCEPTION

JMSCS0033 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''a pas pu cr\u00e9er de trace \u00e0 l''emplacement par d\u00e9faut du syst\u00e8me ''{0}''
JMSCS0033.inserts = XMSC_TRACE_FILE_NAME

JMSCS0034 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''a pas pu cr\u00e9er de trace \u00e0 l''emplacement sp\u00e9cifi\u00e9 ''{0}''
JMSCS0034.inserts = XMSC_TRACE_FILE_NAME

JMSCS0035 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''a pas pu cr\u00e9er de trace \u00e0 l''emplacement en cours ''{0}''
JMSCS0035.inserts = XMSC_TRACE_FILE_NAME

JMSCS0036 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''est pas parvenu \u00e0 analyser la cha\u00eene de recherche de trace ''{0}''
JMSCS0036.inserts = XMSC_SEARCH_STRING

JMSCS0037 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''est pas parvenu \u00e0 instancier le gestionnaire de trace ''{0}''
JMSCS0037.inserts = XMSC_HANDLER_NAME

JMSCS0038 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''est pas parvenu \u00e0 instancier le formateur de trace ''{0}''
JMSCS0038.inserts = XMSC_FORMATTER_NAME

JMSCS0039 = Le m\u00e9canisme de trace du client de messagerie IBM MQ n''est pas parvenu \u00e0 \u00e9crire dans l''outil de diagnostic de premier niveau ''{0}''
JMSCS0039.inserts = XMSC_FDC_NAME

JMSCS0040 = Le m\u00e9canisme de trace du client de messagerie IBM MQ affiche la trace dans ''{0}''
JMSCS0040.inserts = XMSC_TRACE_FILE_NAME

JMSCS0041 = Le m\u00e9canisme de trace du client de messagerie IBM MQ affiche la trace dans la console

JMSCS0042 = La propri\u00e9t\u00e9 ''{0}'' a pour valeur ''{1}''
JMSCS0042.inserts = XMSC_PROPERTY_NAME, XMSC_PROPERTY_VALUE 

JMSCS0043 = Mise en file d''attente de la reconnexion du hconn parent ''{0}'' au gestionnaire de files d''attente ''{1}''
JMSCS0043.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER

JMSCS0044 = D\u00e9marrage de la reconnexion du hconn parent ''{0}'' au gestionnaire de files d''attente ''{1}''
JMSCS0044.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER
JMSCS0044.explanation = Une reconnexion a \u00e9t\u00e9 d\u00e9marr\u00e9e, soit en raison d'une demande provenant d'un cluster uniforme (nom de gestionnaire de files d'attente n'ayant pas la valeur null), soit en raison d'un \u00e9chec de connexion.
JMSCS0044.useraction = Aucune intervention requise.

JMSCS0045 = Abandon de la reconnexion du hconn parent ''{0}''
JMSCS0045.inserts = XMSC_HCONN

JMSCS0046 = Replanification de la reconnexion du hconn parent ''{0}''
JMSCS0046.inserts = XMSC_HCONN
JMSCS0046.explanation = Une reconnexion a \u00e9chou\u00e9 et sera relanc\u00e9e ult\u00e9rieurement. 
JMSCS0046.useraction = Aucune intervention requise.

JMSCS0047 = Reconnexion du hconn parent ''{0}'' termin\u00e9e
JMSCS0047.inserts = XMSC_HCONN

JMSCS0048 = D\u00e9marrage de la reconnexion du hconn enfant ''{0}''
JMSCS0048.inserts = XMSC_HCONN

JMSCS0049 = Echec de la reconnexion du hconn enfant ''{0}''
JMSCS0049.inserts = XMSC_HCONN

JMSCS0050 = Reconnexion du hconn enfant ''{0}'' termin\u00e9e
JMSCS0050.inserts = XMSC_HCONN

JMSCS0051 = Le hconn parent ''{0}'' n''est plus reconnectable
JMSCS0051.inserts = XMSC_HCONN

JMSCS0052 = Le d\u00e9lai de reconnexion du hconn parent ''{0}'' a expir\u00e9
JMSCS0052.inserts = XMSC_HCONN

JMSCS0053 = Temps de reconnexion (millisecondes) : ''{0}''
JMSCS0053.inserts = XMSC_RECONNECTION_TIMES

JMSCS0054 = La demande de reconnexion du hconn parent ''{0}'' a \u00e9chou\u00e9 car le hconn n''est pas pr\u00eat pour la reconnexion
JMSCS0054.inserts = XMSC_HCONN

