# @(#) MQMBID sn=p932-L230207 su=_mMBuZqcAEe2pWoFAaNK_Tg pn=com.ibm.msg.client.commonservices/src/com/ibm/msg/client/commonservices/resources/JMSCS_MessageResourceBundle_pt_BR.properties
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2022"                                              
#   crc="830812269" >                                              
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2022 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = As propriedades no arquivo de propriedades ''{0}'' n\u00e3o puderam ser carregadas devido a uma IOException.
JMSCS0001.useraction = Verifique se o arquivo de propriedades existe e possui as permiss\u00f5es apropriadas.
JMSCS0002 = N\u00e3o foi poss\u00edvel concluir a chamada por que CommonServices n\u00e3o foi inicializado.
JMSCS0002.explanation = CommonServices \u00e9 um componente interno e precisa ser inicializado na inicializa\u00e7\u00e3o, mas falhou.
JMSCS0002.useraction = Verifique se a configura\u00e7\u00e3o de instala\u00e7\u00e3o e do caminho de classe est\u00e1 correta.
JMSCS0003 = Um componente CommonServices n\u00e3o foi localizado.
JMSCS0003.explanation = CommonServices \u00e9 um componente interno e n\u00e3o foi localizado.
JMSCS0003.useraction = Verifique se a configura\u00e7\u00e3o de instala\u00e7\u00e3o e do caminho de classe est\u00e1 correta.
JMSCS0004 = Um componente Messaging Provider n\u00e3o foi localizado.
JMSCS0004.explanation = Um pedido foi feito para utilizar um Messaging Provider que n\u00e3o est\u00e1 presente na configura\u00e7\u00e3o atual.
JMSCS0004.useraction = Verifique se o arquivo JAR que cont\u00e9m o Messaging Provider est\u00e1 presente no caminho de classe ou foi registrado.
JMSCS0005 = Um componente n\u00e3o p\u00f4de ser localizado pelo Component Manager.
JMSCS0005.explanation = Um pedido foi feito para utilizar um Componente que n\u00e3o est\u00e1 presente na configura\u00e7\u00e3o atual.
JMSCS0005.useraction = Verifique se o arquivo JAR que cont\u00e9m o Componente est\u00e1 presente no caminho de classe ou foi registrado.
JMSCS0006 = Ocorreu um problema interno. As informa\u00e7\u00f5es de diagn\u00f3stico para o servi\u00e7o foram gravadas em  ''{0}''. Finalize o aplicativo, visto que o produto est\u00e1 em um estado interno inconsistente.
JMSCS0006.useraction = Salve qualquer arquivo de sa\u00edda gerado e utilize o site de Suporte do WMQ: http://www.ibm.com/software/integration/wmq/support/, ou o ISA (IBM Support Assistant): http://www.ibm.com/software/support/isa/, para consultar se uma solu\u00e7\u00e3o j\u00e1 est\u00e1 dispon\u00edvel.  Se n\u00e3o for poss\u00edvel localizar uma correspond\u00eancia, entre em contato com o centro de suporte da IBM.
JMSCS0007 = EXPLICA\u00c7\u00c3O:
JMSCS0008 = A\u00c7\u00c3O:

JMSCS0009 = N\u00e3o foi poss\u00edvel carregar as propriedades do sistema, devido a uma AccessControlException.
JMSCS0009.explanation = O PropertyStore n\u00e3o p\u00f4de consultar as propriedades do sistema, por que a pol\u00edtica de seguran\u00e7a n\u00e3o o permite.
JMSCS0009.useraction = Modifique a pol\u00edtica de seguran\u00e7a para permitir que as propriedades do sistema sejam lidas.

JMSCS0010 = O IBM Messaging Client Common Services n\u00e3o p\u00f4de localizar ou inicializar um componente devido \u00e0 exce\u00e7\u00e3o ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Mensagem
JMSCS0012 = Par\u00e2metro class
JMSCS0013 = Pilha
JMSCS0014 = Causado por [{0}] --> Mensagem
JMSCS0015 = Objeto comum em estado inv\u00e1lido

JMSCS0016 = Falha na opera\u00e7\u00e3o do Command Manager.

JMSCS0017 = Arquivo de configura\u00e7\u00e3o do CommonServices lido a partir de ''{0}''
JMSCS0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Nome da propriedade desconhecido fornecido ''{0}''
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = A propriedade ''{0}'' j\u00e1 foi configurada por ''{1}''. Ela n\u00e3o pode ser atualizada.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = A classe pode n\u00e3o ser serializada ou desserializada, pois n\u00e3o foi inclu\u00edda na lista de permiss\u00f5es ''{0}''.
JMSCS0020.inserts = XMSC_ALLOWLIST

JMSCS0021 = O arquivo da lista de permiss\u00f5es ''{0}'' n\u00e3o pode ser aberto
JMSCS0021.inserts = XMSC_ALLOWLIST

JMSCS0022 = O arquivo da lista de permiss\u00f5es ''{0}'' j\u00e1 existe e n\u00e3o pode ser sobrescrito
JMSCS0022.inserts = XMSC_ALLOWLIST

JMSCS0023 = A lista de permiss\u00f5es ''{0}'' tem uma entrada inv\u00e1lida
JMSCS0023.inserts = XMSC_ALLOWLIST

JMSCS0024 = O arquivo da lista de permiss\u00f5es n\u00e3o p\u00f4de ser gravado

JMSCS0025 = Lista de permiss\u00f5es ENFORCEMENT ativada. O arquivo da lista de permiss\u00f5es ''{0}'' est\u00e1 sendo usado para validar as opera\u00e7\u00f5es de serializa\u00e7\u00e3o e desserializa\u00e7\u00e3o de ObjectMessage. A \u00e1rvore da lista de permiss\u00f5es \u00e9 ''{1}''
JMSCS0025.inserts = XMSC_ALLOWLIST,XMSC_ALLOWLIST_CONTENTS

JMSCS0026 = Lista de permiss\u00f5es DISCOVERY ativada. O arquivo da lista de permiss\u00f5es ''{0}'' est\u00e1 sendo usado para registrar as opera\u00e7\u00f5es de serializa\u00e7\u00e3o e desserializa\u00e7\u00e3o de ObjectMessage
JMSCS0026.inserts = XMSC_ALLOWLIST

JMSCS0027 = Lista de permiss\u00f5es ENFORCEMENT ativada. A lista de permiss\u00f5es ''{0}'' est\u00e1 sendo usada para validar as opera\u00e7\u00f5es de serializa\u00e7\u00e3o e desserializa\u00e7\u00e3o de ObjectMessage
JMSCS0027.inserts = XMSC_ALLOWLIST

JMSCS0028 = Lista de permiss\u00f5es DISCOVERY solicitada, mas o nome do arquivo da lista de permiss\u00f5es ''{0}'' n\u00e3o \u00e9 um URI de arquivo
JMSCS0028.inserts = XMSC_ALLOWLIST

JMSCS0029 = Nenhuma funcionalidade da lista de permiss\u00f5es ativada. As propriedades n\u00e3o foram configuradas ou as permiss\u00f5es de seguran\u00e7a impedem a leitura delas

JMSCS0030 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ n\u00e3o tem permiss\u00e3o para gravar no arquivo de rastreio ''{0}'' no diret\u00f3rio ''{1}''
JMSCS0030.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME 

JMSCS0031 = Ocorreu uma exce\u00e7\u00e3o ao tentar gravar o arquivo de rastreio ''{0}'' no diret\u00f3rio de rastreio ''{1}''. A exce\u00e7\u00e3o foi ''{2}''
JMSCS0031.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME, XMSC_EXCEPTION

JMSCS0032 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ n\u00e3o p\u00f4de inicializar o arquivo de rastreio ''{0}'' devido \u00e0 exce\u00e7\u00e3o ''{1}''. O rastreio ser\u00e1 gravado em System.Err. 
JMSCS0032.inserts = XMSC_TRACE_FILE_NAME, XMSC_EXCEPTION

JMSCS0033 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ n\u00e3o p\u00f4de criar o criar o rastreio no local padr\u00e3o do sistema ''{0}''
JMSCS0033.inserts = XMSC_TRACE_FILE_NAME

JMSCS0034 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ n\u00e3o p\u00f4de criar o rastreio no local especificado ''{0}''
JMSCS0034.inserts = XMSC_TRACE_FILE_NAME

JMSCS0035 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ n\u00e3o p\u00f4de criar o rastreio no local atual ''{0}''
JMSCS0035.inserts = XMSC_TRACE_FILE_NAME

JMSCS0036 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ falhou ao analisar a sequ\u00eancia de procura de rastreio ''{0}''
JMSCS0036.inserts = XMSC_SEARCH_STRING

JMSCS0037 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ falhou ao instanciar o TraceHandler ''{0}''
JMSCS0037.inserts = XMSC_HANDLER_NAME

JMSCS0038 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ falhou ao instanciar o TraceFormatter ''{0}''
JMSCS0038.inserts = XMSC_FORMATTER_NAME

JMSCS0039 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ falhou ao gravar o FFDC ''{0}''
JMSCS0039.inserts = XMSC_FDC_NAME

JMSCS0040 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ est\u00e1 sendo rastreado para ''{0}''
JMSCS0040.inserts = XMSC_TRACE_FILE_NAME

JMSCS0041 = O mecanismo de rastreio do cliente do sistema de mensagens do IBM MQ est\u00e1 sendo rastreado para o console

JMSCS0042 = A propriedade ''{0}'' tem o valor ''{1}''
JMSCS0042.inserts = XMSC_PROPERTY_NAME, XMSC_PROPERTY_VALUE 

JMSCS0043 = Reconex\u00e3o de enfileiramento do hconn pai ''{0}'' com o gerenciador de filas ''{1}''
JMSCS0043.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER

JMSCS0044 = Iniciando a reconex\u00e3o do hconn pai ''{0}'' com o gerenciador de filas ''{1}''
JMSCS0044.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER
JMSCS0044.explanation = Uma reconex\u00e3o foi iniciada, seja devido a uma solicita\u00e7\u00e3o de um cluster uniforme (nome de gerenciador de filas n\u00e3o nulo) ou como resultado de uma falha de conex\u00e3o.
JMSCS0044.useraction = Nenhuma a\u00e7\u00e3o \u00e9 necess\u00e1ria.

JMSCS0045 = Interrompendo a reconex\u00e3o do hconn pai ''{0}''
JMSCS0045.inserts = XMSC_HCONN

JMSCS0046 = Reagendando a reconex\u00e3o do hconn pai ''{0}''
JMSCS0046.inserts = XMSC_HCONN
JMSCS0046.explanation = Uma nova tentativa de conex\u00e3o falhou e ser\u00e1 feita uma nova tentativa mais tarde. 
JMSCS0046.useraction = Nenhuma a\u00e7\u00e3o \u00e9 necess\u00e1ria.

JMSCS0047 = Reconex\u00e3o conclu\u00edda do hconn pai ''{0}''
JMSCS0047.inserts = XMSC_HCONN

JMSCS0048 = Iniciando a reconex\u00e3o do hconn filho ''{0}''
JMSCS0048.inserts = XMSC_HCONN

JMSCS0049 = Reconex\u00e3o com falha do hconn filho ''{0}''
JMSCS0049.inserts = XMSC_HCONN

JMSCS0050 = Reconex\u00e3o conclu\u00edda do hconn filho ''{0}''
JMSCS0050.inserts = XMSC_HCONN

JMSCS0051 = O hconn pai ''{0}'' n\u00e3o \u00e9 mais reconect\u00e1vel
JMSCS0051.inserts = XMSC_HCONN

JMSCS0052 = O tempo de reconex\u00e3o do hconn pai ''{0}'' expirou
JMSCS0052.inserts = XMSC_HCONN

JMSCS0053 = Tempos de reconex\u00e3o (milissegundos): ''{0}''
JMSCS0053.inserts = XMSC_RECONNECTION_TIMES

JMSCS0054 = Ignorando a solicita\u00e7\u00e3o de reconex\u00e3o do hconn pai ''{0}'', pois o hconn n\u00e3o est\u00e1 pronto para ela.
JMSCS0054.inserts = XMSC_HCONN

