# @(#) MQMBID sn=p932-L230207 su=_mMBuZqcAEe2pWoFAaNK_Tg pn=com.ibm.msg.client.commonservices/src/com/ibm/msg/client/commonservices/resources/JMSCS_MessageResourceBundle_it.properties
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2022"                                              
#   crc="830812269" >                                              
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2022 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Non \u00e8 stato possibile caricare le propriet\u00e0 dal file delle propriet\u00e0 ''{0}'' a causa di una IOException.
JMSCS0001.useraction = Controllare che il file delle propriet\u00e0 esista e che disponga delle autorizzazioni appropriate.
JMSCS0002 = Non \u00e8 stato possibile completare la chiamata perch\u00e9 CommonServices non \u00e8 stato inizializzato.
JMSCS0002.explanation = CommonServices \u00e8 un componente interno e deve essere inizializzato all'avvio ma si \u00e8 verificato un suo malfunzionamento.
JMSCS0002.useraction = Verificare che l'installazione e la configurazione del percorso di classe siano corrette.
JMSCS0003 = Non \u00e8 stato trovato un componente CommonServices.
JMSCS0003.explanation = CommonServices \u00e8 un componente interno e non \u00e8 stato trovato.
JMSCS0003.useraction = Verificare che l'installazione e la configurazione del percorso di classe siano corrette.
JMSCS0004 = Non \u00e8 stato trovato il componente del provider di messaggistica.
JMSCS0004.explanation = \u00c8 stata fatta una richiesta di utilizzare un provider di messaggistica che non \u00e8 presente nella configurazione corrente.
JMSCS0004.useraction = Controllare che il file JAR che contiene il provider di messaggistica sia presente nel classpath o che sia stato registrato.
JMSCS0005 = Il gestore componenti non \u00e8 stato in grado di individuare un componente.
JMSCS0005.explanation = \u00c8 stata fatta una richiesta di utilizzare un componente che non \u00e8 presente nella configurazione corrente.
JMSCS0005.useraction = Controllare che il file JAR che contiene il componente sia presente nel classpath o che sia stato registrato.
JMSCS0006 = Si \u00e8 verificato un problema interno. Le informazioni di diagnostica per il servizio sono state scritte in ''{0}''. Terminare l''applicazione poich\u00e9 il prodotto \u00e8 in uno stato interno incongruente.
JMSCS0006.useraction = Salvare tutti i file di output generati e utilizzare il sito dell'assistenza WMQ: http://www.ibm.com/software/integration/wmq/support/, o l'ISA(IBM Support Assistant): http://www.ibm.com/software/support/isa/, per vedere se \u00e8 gi\u00e0 disponibile una soluzione.  In caso di impossibilit\u00e0 di trovare una corrispondenza, contattare il centro assistenza IBM.
JMSCS0007 = SPIEGAZIONE:
JMSCS0008 = AZIONE:

JMSCS0009 = Non \u00e8 stato possibile caricare le propriet\u00e0 del sistema a causa di una AccessControlException.
JMSCS0009.explanation = PropertyStore non \u00e8 stato in grado di eseguire una query delle propriet\u00e0 del sistema perch\u00e9 la politica di sicurezza non lo consente.
JMSCS0009.useraction = Modificare la politica di sicurezza per consentire la lettura delle propriet\u00e0 del sistema.

JMSCS0010 = I servizi comuni di IBM Messaging Client non sono riusciti a localizzare e inizializzare un componente a causa dell''eccezione ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Messaggio
JMSCS0012 = Classe
JMSCS0013 = Stack
JMSCS0014 = Causato da [{0}] --> Messaggio
JMSCS0015 = Oggetto comune in stato non valido

JMSCS0016 = Operazione del gestore comandi non riuscita.

JMSCS0017 = File di configurazione CommonServices letto da ''{0}''
JMSCS0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = \u00c8 stato fornito un nome propriet\u00e0 sconosciuto ''{0}''
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = La propriet\u00e0 ''{0}'' \u00e8 gi\u00e0 stata impostata da ''{1}''. Non pu\u00f2 essere aggiornata.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = La classe non pu\u00f2 essere serializzata o deserializzata poich\u00e9 non \u00e8 stata inclusa nell''elenco di elementi consentiti ''{0}''.
JMSCS0020.inserts = XMSC_ALLOWLIST

JMSCS0021 = Impossibile aprire il file dell''elenco elementi consentiti ''{0}''
JMSCS0021.inserts = XMSC_ALLOWLIST

JMSCS0022 = Il file dell''elenco elementi consentiti ''{0}'' esiste gi\u00e0 e non pu\u00f2 essere sovrascritto
JMSCS0022.inserts = XMSC_ALLOWLIST

JMSCS0023 = L''elenco elementi consentiti ''{0}'' ha una voce non valida
JMSCS0023.inserts = XMSC_ALLOWLIST

JMSCS0024 = Impossibile scrivere nel file dell'elenco elementi consentiti

JMSCS0025 = IMPOSIZIONE abilitata per l''elenco elementi consentiti - il file dell''elenco elementi consentiti ''{0}'' verr\u00e0 utilizzato per convalidare le operazioni di serializzazione e deserializzazione di ObjectMessage - la struttura ad albero dell''elenco elementi consentiti \u00e8 ''{1}''
JMSCS0025.inserts = XMSC_ALLOWLIST,XMSC_ALLOWLIST_CONTENTS

JMSCS0026 = INDIVIDUAZIONE abilitata per l''elenco elementi consentiti - Il file dell''elenco elementi consentiti ''{0}'' verr\u00e0 utilizzato per registrare le operazioni di serializzazione e deserializzazione di ObjectMessage
JMSCS0026.inserts = XMSC_ALLOWLIST

JMSCS0027 = MPOSIZIONE abilitata per l''elenco elementi consentiti - l''elenco elementi consentiti ''{0}'' verr\u00e0 utilizzato per convalidare le operazioni di serializzazione e deserializzazione di ObjectMessage
JMSCS0027.inserts = XMSC_ALLOWLIST

JMSCS0028 = INDIVIDUAZIONE richiesta per l''elenco elementi consentiti, ma il nome file dell''elenco elementi consentiti ''{0}'' non \u00e8 un URI di file
JMSCS0028.inserts = XMSC_ALLOWLIST

JMSCS0029 = Nessuna funzionalit\u00e0 abilitata per l'elenco elementi consentiti - le propriet\u00e0 non sono state impostate o le autorizzazioni di sicurezza ne impediscono la lettura

JMSCS0030 = Il meccanismo di traccia del client di messaggistica IBM MQ non dispone dell''autorizzazione per scrivere nel file di traccia ''{0}'' nella directory ''{1}''
JMSCS0030.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME 

JMSCS0031 = Si \u00e8 verificata un''eccezione durante il tentativo di scrivere il file di traccia ''{0}'' nella directory di traccia ''{1}''. L''eccezione \u00e8 ''{2}''
JMSCS0031.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME, XMSC_EXCEPTION

JMSCS0032 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 stato in grado di inizializzare il file di traccia ''{0}'' a causa dell''eccezione ''{1}''. La traccia verr\u00e0 scritta in System.Err. 
JMSCS0032.inserts = XMSC_TRACE_FILE_NAME, XMSC_EXCEPTION

JMSCS0033 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 stato in grado di creare la traccia nell''ubicazione predefinita del sistema ''{0}''
JMSCS0033.inserts = XMSC_TRACE_FILE_NAME

JMSCS0034 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 stato in grado di creare la traccia nell''ubicazione specificata ''{0}''
JMSCS0034.inserts = XMSC_TRACE_FILE_NAME

JMSCS0035 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 stato in grado di creare la traccia nell''ubicazione corrente ''{0}''
JMSCS0035.inserts = XMSC_TRACE_FILE_NAME

JMSCS0036 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 riuscito ad analizzare la stringa di ricerca della traccia ''{0}''
JMSCS0036.inserts = XMSC_SEARCH_STRING

JMSCS0037 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 riuscito a istanziare TraceHandler ''{0}''
JMSCS0037.inserts = XMSC_HANDLER_NAME

JMSCS0038 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 riuscito a istanziare TraceFormatter ''{0}''
JMSCS0038.inserts = XMSC_FORMATTER_NAME

JMSCS0039 = Il meccanismo di traccia del client di messaggistica IBM MQ non \u00e8 riuscito a scrivere in FFDC ''{0}''
JMSCS0039.inserts = XMSC_FDC_NAME

JMSCS0040 = Il meccanismo di traccia del client di messaggistica IBM MQ sta eseguendo la traccia in ''{0}''
JMSCS0040.inserts = XMSC_TRACE_FILE_NAME

JMSCS0041 = Il meccanismo di traccia del client di messaggistica IBM MQ sta eseguendo la traccia nella console

JMSCS0042 = La propriet\u00e0 ''{0}'' ha il valore ''{1}''
JMSCS0042.inserts = XMSC_PROPERTY_NAME, XMSC_PROPERTY_VALUE 

JMSCS0043 = Accodamento riconnessione di hconn parent ''{0}'' al gestore code ''{1}''
JMSCS0043.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER

JMSCS0044 = Avvio riconnessione di hconn parent ''{0}'' al gestore code ''{1}''
JMSCS0044.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER
JMSCS0044.explanation = \u00c8 stata avviata una riconnessione, dovuta a una richiesta da un cluster uniforme (nome gestore code non null) o a seguito di un errore di connessione.
JMSCS0044.useraction = Nessuna richiesta.

JMSCS0045 = Interruzione riconnessione a hconn parent ''{0}''
JMSCS0045.inserts = XMSC_HCONN

JMSCS0046 = Ripianificazione riconnessione a hconn parent ''{0}''
JMSCS0046.inserts = XMSC_HCONN
JMSCS0046.explanation = Una riconnessione non \u00e8 riuscita e verr\u00e0 ritentata in seguito. 
JMSCS0046.useraction = Nessuna richiesta.

JMSCS0047 = Riconnessione di hconn parent ''{0}'' completata
JMSCS0047.inserts = XMSC_HCONN

JMSCS0048 = Avvio riconnessione di hconn child ''{0}''
JMSCS0048.inserts = XMSC_HCONN

JMSCS0049 = Riconnessione di hconn child ''{0}'' non riuscita
JMSCS0049.inserts = XMSC_HCONN

JMSCS0050 = Riconnessione di hconn child ''{0}'' completata
JMSCS0050.inserts = XMSC_HCONN

JMSCS0051 = L''hconn parent ''{0}'' non \u00e8 pi\u00f9 ricollegabile
JMSCS0051.inserts = XMSC_HCONN

JMSCS0052 = Tempo di riconnessione hconn parent ''{0}'' scaduto
JMSCS0052.inserts = XMSC_HCONN

JMSCS0053 = Tempi di riconnessione (millisecondi): ''{0}''
JMSCS0053.inserts = XMSC_RECONNECTION_TIMES

JMSCS0054 = Viene ignorata la richiesta di riconnessione dell''hconn parent ''{0}'' poich\u00e9 l''hconn non \u00e8 pronto per la riconnessione
JMSCS0054.inserts = XMSC_HCONN

