# @(#) MQMBID sn=p932-L230207 su=_mMBuZqcAEe2pWoFAaNK_Tg pn=com.ibm.msg.client.commonservices/src/com/ibm/msg/client/commonservices/resources/JMSCS_MessageResourceBundle_es.properties
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2022"                                              
#   crc="830812269" >                                              
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2022 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = Las propiedades del archivo de propiedades ''{0}'' no se han podido cargar debido a una Excepci\u00f3n de E/S.
JMSCS0001.useraction = Compruebe que el archivo de propiedades existe y que tiene los permisos adecuados.
JMSCS0002 = La llamada no se ha podido realizar porque CommonServices no se ha inicializado.
JMSCS0002.explanation = CommonServices es un componente interno y tiene que inicializarse durante el arranque pero ha fallado.
JMSCS0002.useraction = Compruebe que la configuraci\u00f3n de la instalaci\u00f3n y de la v\u00eda de acceso de clases es correcta.
JMSCS0003 = No se ha encontrado un componente CommonServices.
JMSCS0003.explanation = CommonServices es un componente interno y no se ha encontrado.
JMSCS0003.useraction = Compruebe que la configuraci\u00f3n de la instalaci\u00f3n y de la v\u00eda de acceso de clases es correcta.
JMSCS0004 = No se ha encontrado un componente Proveedor de mensajer\u00eda.
JMSCS0004.explanation = Se ha realizado una petici\u00f3n para utilizar un Proveedor de mensajer\u00eda que no est\u00e1 presente en la configuraci\u00f3n actual.
JMSCS0004.useraction = Compruebe que el archivo JAR que contiene el Proveedor de mensajer\u00eda est\u00e1 presente en la v\u00eda de acceso de clases o que se ha registrado.
JMSCS0005 = El Gestor de componentes no ha podido localizar un componente.
JMSCS0005.explanation = Se ha realizado una petici\u00f3n para utilizar un componente que no est\u00e1 presente en la configuraci\u00f3n actual.
JMSCS0005.useraction = Compruebe que el archivo JAR que contiene el componente est\u00e1 presente en la v\u00eda de acceso de clases o que se ha registrado.
JMSCS0006 = Se ha producido un problema interno. La informaci\u00f3n de diagn\u00f3stico para el servicio t\u00e9cnico se ha grabado en ''{0}''. Termine la aplicaci\u00f3n ya que el producto est\u00e1 en un estado interno incoherente.
JMSCS0006.useraction = Guarde todos los archivos de salida generados y utilice el sitio de Soporte de WMQ: http://www.ibm.com/software/integration/wmq/support/, o IBM Support Assistant (ISA): http://www.ibm.com/software/support/isa/, para ver si ya hay una soluci\u00f3n disponible.  Si no puede encontrar una soluci\u00f3n, p\u00f3ngase en contacto con el centro de soporte de IBM.
JMSCS0007 = EXPLICACI\u00d3N:
JMSCS0008 = ACCI\u00d3N:

JMSCS0009 = Las propiedades del sistema no se han podido cargar debido a una excepci\u00f3n AccessControlException.
JMSCS0009.explanation = PropertyStore no ha podido consultar las propiedades del sistema porque la pol\u00edtica de seguridad no lo permite.
JMSCS0009.useraction = Modifique la pol\u00edtica de seguridad para permitir la lectura de las propiedades del sistema.

JMSCS0010 = No se han podido localizar los servicios comunes del cliente de mensajer\u00eda de IBM o inicializar un componente debido a la excepci\u00f3n ''{0}''.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = Mensaje
JMSCS0012 = Clase
JMSCS0013 = Pila
JMSCS0014 = Se debe a [{0}] --> Mensaje
JMSCS0015 = Objeto com\u00fan en estado no v\u00e1lido

JMSCS0016 = La operaci\u00f3n del gestor de mandatos ha fallado.

JMSCS0017 = Se ha le\u00eddo el archivo de configuraci\u00f3n de CommonServices desde ''{0}''
JMSCS0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Se ha proporcionado un nombre de propiedad ''{0}'' desconocido
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = La propiedad ''{0}'' ya ha sido establecida por ''{1}''. No se puede actualizar.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = Es posible que la clase no se serialice o deserialice ya que no se ha incluido en la lista blanca ''{0}''.
JMSCS0020.inserts = XMSC_ALLOWLIST

JMSCS0021 = El archivo de la lista blanca ''{0}'' no se puede abrir
JMSCS0021.inserts = XMSC_ALLOWLIST

JMSCS0022 = El archivo de la lista blanca ''{0}'' ya existe y es posible que no se sobrescriba
JMSCS0022.inserts = XMSC_ALLOWLIST

JMSCS0023 = La lista blanca ''{0}'' tiene una entrada no v\u00e1lida
JMSCS0023.inserts = XMSC_ALLOWLIST

JMSCS0024 = El archivo de lista blanca no se ha podido escribir

JMSCS0025 = Lista blanca ENFORCEMENT habilitada - el archivo de lista blanca ''{0}'' se est\u00e1 utilizando para validar las operaciones de serializaci\u00f3n y desearializaci\u00f3n de ObjectMessage - el \u00e1rbol de la lista blanca es ''{1}''
JMSCS0025.inserts = XMSC_ALLOWLIST,XMSC_ALLOWLIST_CONTENTS

JMSCS0026 = Lista blanca DISCOVERY habilitada - El archivo de lista blanca ''{0}'' se est\u00e1 utilizando para registrar las operaciones de serializaci\u00f3n y deserializaci\u00f3n de ObjectMessage
JMSCS0026.inserts = XMSC_ALLOWLIST

JMSCS0027 = Lista blanca ENFORCEMENT habilitada - la lista blanca ''{0}'' se est\u00e1 utilizando para validar operaciones de serializaci\u00f3n y deserializaci\u00f3n de ObjectMessage
JMSCS0027.inserts = XMSC_ALLOWLIST

JMSCS0028 = Lista blanca DISCOVERY solicitada, pero el nombre de archivo de lista blanca ''{0}'' no es un URI de archivo
JMSCS0028.inserts = XMSC_ALLOWLIST

JMSCS0029 = No hay ninguna funcionalidad de lista blanca habilitada - las propiedades no se han establecido, o bien los permisos de seguridad impiden su lectura

JMSCS0030 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no dispone de permiso para escribir en el archivo de rastreo ''{0}'' del directorio ''{1}''
JMSCS0030.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME 

JMSCS0031 = Se ha producido una excepci\u00f3n cuando se intentaba escribir en el archivo de rastreo ''{0}'' del directorio de rastreo ''{1}''. La excepci\u00f3n era ''{2}''
JMSCS0031.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME, XMSC_EXCEPTION

JMSCS0032 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido inicializar el archivo de rastreo ''{0}'' debido a la excepci\u00f3n ''{1}''. El rastreo se escribir\u00e1 en System.Err. 
JMSCS0032.inserts = XMSC_TRACE_FILE_NAME, XMSC_EXCEPTION

JMSCS0033 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido crear el rastreo en la ubicaci\u00f3n predeterminada del sistema ''{0}''
JMSCS0033.inserts = XMSC_TRACE_FILE_NAME

JMSCS0034 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido crear el rastreo en la ubicaci\u00f3n especificada ''{0}''
JMSCS0034.inserts = XMSC_TRACE_FILE_NAME

JMSCS0035 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido crear el rastreo en la ubicaci\u00f3n actual ''{0}''
JMSCS0035.inserts = XMSC_TRACE_FILE_NAME

JMSCS0036 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido analizar la serie de b\u00fasqueda de rastreo ''{0}''
JMSCS0036.inserts = XMSC_SEARCH_STRING

JMSCS0037 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido crear la instancia TraceHandler ''{0}''
JMSCS0037.inserts = XMSC_HANDLER_NAME

JMSCS0038 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido crear la instancia TraceFormatter ''{0}''
JMSCS0038.inserts = XMSC_FORMATTER_NAME

JMSCS0039 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ no ha podido escribir en FFDC ''{0}''
JMSCS0039.inserts = XMSC_FDC_NAME

JMSCS0040 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ est\u00e1 realizando un rastreo en ''{0}''
JMSCS0040.inserts = XMSC_TRACE_FILE_NAME

JMSCS0041 = El mecanismo de rastreo de clientes de mensajer\u00eda de IBM MQ est\u00e1 realizando un rastreo en la consola

JMSCS0042 = La propiedad ''{0}'' tiene el valor ''{1}''
JMSCS0042.inserts = XMSC_PROPERTY_NAME, XMSC_PROPERTY_VALUE 

JMSCS0043 = Poniendo en cola la reconexi\u00f3n del hconn padre ''{0}'' al gestor de colas ''{1}''
JMSCS0043.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER

JMSCS0044 = Iniciando la reconexi\u00f3n del hconn padre ''{0}'' al gestor de colas ''{1}''
JMSCS0044.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER
JMSCS0044.explanation = Se ha iniciado una reconexi\u00f3n, ya sea debido a una solicitud de un cl\u00faster uniforme (nombre de gestor de colas no nulo) o como resultado de un error de conexi\u00f3n.
JMSCS0044.useraction = No se requiere llevar a cabo ninguna acci\u00f3n.

JMSCS0045 = Terminando anormalmente la reconexi\u00f3n del hconn padre ''{0}''
JMSCS0045.inserts = XMSC_HCONN

JMSCS0046 = Volviendo a programar la reconexi\u00f3n del hconn padre ''{0}''
JMSCS0046.inserts = XMSC_HCONN
JMSCS0046.explanation = Una reconexi\u00f3n ha fallado y se volver\u00e1 a intentar m\u00e1s tarde. 
JMSCS0046.useraction = No se requiere llevar a cabo ninguna acci\u00f3n.

JMSCS0047 = Reconexi\u00f3n del hconn padre ''{0}'' completada
JMSCS0047.inserts = XMSC_HCONN

JMSCS0048 = Iniciando reconexi\u00f3n del hconn hijo ''{0}''
JMSCS0048.inserts = XMSC_HCONN

JMSCS0049 = Error de reconexi\u00f3n del hconn hijo ''{0}''
JMSCS0049.inserts = XMSC_HCONN

JMSCS0050 = Reconexi\u00f3n del hconn hijo ''{0}'' completada
JMSCS0050.inserts = XMSC_HCONN

JMSCS0051 = El hconn padre ''{0}'' ya no se puede volver a conectar
JMSCS0051.inserts = XMSC_HCONN

JMSCS0052 = Ha caducado el tiempo de reconexi\u00f3n del hconn padre ''{0}''
JMSCS0052.inserts = XMSC_HCONN

JMSCS0053 = Tiempos de reconexi\u00f3n (milisegundos) : ''{0}''
JMSCS0053.inserts = XMSC_RECONNECTION_TIMES

JMSCS0054 = Ignorando la solicitud de reconexi\u00f3n del hconn padre ''{0}'' ya que el hconn no est\u00e1 listo para la reconexi\u00f3n
JMSCS0054.inserts = XMSC_HCONN

