# @(#) MQMBID sn=p932-L230207 su=_mMBuZqcAEe2pWoFAaNK_Tg pn=com.ibm.msg.client.commonservices/src/com/ibm/msg/client/commonservices/resources/JMSCS_MessageResourceBundle_hu.properties
#
#  <copyright                                                     
#   notice="lm-source-program"                                     
#   pids="5724-H72"                                                
#   years="2008,2022"                                              
#   crc="830812269" >                                              
#   Licensed Materials - Property of IBM                           
#                                                                  
#   5724-H72                                                       
#                                                                  
#   (C) Copyright IBM Corp. 2008, 2022 All Rights Reserved.        
#                                                                  
#   US Government Users Restricted Rights - Use, duplication or    
#   disclosure restricted by GSA ADP Schedule Contract with        
#   IBM Corp.                                                      
#   </copyright> 
#
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_VAR

JMSCS0001 = A tulajdons\u00e1gok a(z) ''{0}'' tulajdons\u00e1gf\u00e1jlb\u00f3l IOException miatt nem t\u00f6lthet\u0151k be.
JMSCS0001.useraction = Ellen\u0151rizze, hogy a tulajdons\u00e1gf\u00e1jl l\u00e9tezik \u00e9s megfelel\u0151 jogosults\u00e1gokkal rendelkezik.
JMSCS0002 = A h\u00edv\u00e1s nem v\u00e9gezhet\u0151 el, mert a CommonServices nem lett inicializ\u00e1lva.
JMSCS0002.explanation = A CommonServices egy olyan bels\u0151 \u00f6sszetev\u0151, amelyet inicializ\u00e1lni kell az ind\u00edt\u00e1skor, de ez meghi\u00fasult.
JMSCS0002.useraction = Ellen\u0151rizze, hogy a telep\u00edt\u00e9s \u00e9s az oszt\u00e1ly\u00fatvonal be\u00e1ll\u00edt\u00e1sa helyes.
JMSCS0003 = Egy CommonServices \u00f6sszetev\u0151 nem tal\u00e1lhat\u00f3.
JMSCS0003.explanation = A CommonServices egy bels\u0151 \u00f6sszetev\u0151, \u00e9s nem tal\u00e1lhat\u00f3.
JMSCS0003.useraction = Ellen\u0151rizze, hogy a telep\u00edt\u00e9s \u00e9s az oszt\u00e1ly\u00fatvonal be\u00e1ll\u00edt\u00e1sa helyes.
JMSCS0004 = Egy Messaging Provider \u00f6sszetev\u0151 nem tal\u00e1lhat\u00f3.
JMSCS0004.explanation = Olyan Messaging Provider haszn\u00e1lat\u00e1ra vonatkoz\u00f3 k\u00e9r\u00e9s \u00e9rkezett, ami nincs jelen a jelenlegi konfigur\u00e1ci\u00f3ban.
JMSCS0004.useraction = Ellen\u0151rizze, hogy a Messaging Provider \u00f6sszetev\u0151t tartalmaz\u00f3 JAR f\u00e1jl jelen van az oszt\u00e1ly\u00fatvonalon, illetve regisztr\u00e1lva van.
JMSCS0005 = A Component Manager nem tal\u00e1lt meg egy \u00f6sszetev\u0151t.
JMSCS0005.explanation = Olyan \u00f6sszetev\u0151 haszn\u00e1lat\u00e1ra vonatkoz\u00f3 k\u00e9r\u00e9s \u00e9rkezett, ami nincs jelen a jelenlegi konfigur\u00e1ci\u00f3ban.
JMSCS0005.useraction = Ellen\u0151rizze, hogy az \u00f6sszetev\u0151t tartalmaz\u00f3 JAR f\u00e1jl jelen van az oszt\u00e1ly\u00fatvonalon, illetve regisztr\u00e1lva van.
JMSCS0006 = Bels\u0151 probl\u00e9ma mer\u00fclt fel. A szolg\u00e1ltat\u00e1s diagnosztikai inform\u00e1ci\u00f3it ide \u00edrta a rendszer: ''{0}''. \u00c1ll\u00edtsa le az alkalmaz\u00e1st, mivel a term\u00e9k k\u00f6vetkezetlen bels\u0151 \u00e1llapotban van.
JMSCS0006.useraction = Mentse el az el\u0151\u00e1ll\u00edtott kimeneti f\u00e1jlokat, \u00e9s vagy a WMQ term\u00e9kt\u00e1mogat\u00e1si h\u00e1l\u00f3szem: http://www.ibm.com/software/integration/wmq/support/, vagy az IBM t\u00e1mogat\u00e1si seg\u00e9dlet (ISA): http://www.ibm.com/software/support/isa/ haszn\u00e1lat\u00e1val j\u00e1rjon ut\u00e1na, hogy van-e m\u00e1r rendelkez\u00e9sre \u00e1ll\u00f3 megold\u00e1s.  Ha nem tal\u00e1l ilyet, akkor l\u00e9pjen kapcsolatba az IBM term\u00e9kt\u00e1mogat\u00e1si k\u00f6zponttal.
JMSCS0007 = MAGYAR\u00c1ZAT:
JMSCS0008 = M\u0170VELET:

JMSCS0009 = A rendszertulajdons\u00e1gok AccessControlException miatt nem t\u00f6lthet\u0151k be.
JMSCS0009.explanation = A PropertyStore nem tudta lek\u00e9rdezni a rendszertulajdons\u00e1gokat, mert a biztons\u00e1gi h\u00e1zirend nem engedi azt.
JMSCS0009.useraction = M\u00f3dos\u00edtsa a biztons\u00e1gi h\u00e1zirendet \u00fagy, hogy megengedje a tulajdons\u00e1gok beolvas\u00e1s\u00e1t.

JMSCS0010 = Az IBM Messaging Client Common Services ''{0}'' kiv\u00e9tel miatt nem tal\u00e1lt egy \u00f6sszetev\u0151t, illetve nem tudta inicializ\u00e1lni azt.
JMSCS0010.inserts = XMSC_INSERT_EXCEPTION

JMSCS0011 = \u00dczenet
JMSCS0012 = Oszt\u00e1ly
JMSCS0013 = Verem
JMSCS0014 = [{0}] okozta --> \u00dczenet
JMSCS0015 = K\u00f6z\u00f6s objektum \u00e9rv\u00e9nytelen \u00e1llapotban

JMSCS0016 = A parancskezel\u0151 m\u0171velet meghi\u00fasult.

JMSCS0017 = CommonServices konfigur\u00e1ci\u00f3s f\u00e1jl beolvas\u00e1sa a k\u00f6vetkez\u0151b\u0151l: ''{0}''
JMSCS0017.inserts = XMSC_CONFIG_FILE_LOCATION

JMSCS0018 = Ismeretlen tulajdons\u00e1gn\u00e9v lett megadva: {0}''
JMSCS0018.inserts = XMSC_PROPERTY_NAME

JMSCS0019 = A(z) ''{0}'' tulajdons\u00e1got m\u00e1r a(z) ''{1}'' be\u00e1ll\u00edtotta. Nem friss\u00edthet\u0151.
JMSCS0019.inserts = XMSC_PROPERTY_NAME,XMSC_PROPERTY_SOURCE

JMSCS0020 = Az oszt\u00e1lyt nem lehet soros\u00edtani vagy a soros\u00edtott form\u00e1t visszaalak\u00edtani, mivel a(z) ''{0}'' enged\u00e9lyez\u00e9si lista nem tartalmazza.
JMSCS0020.inserts = XMSC_ALLOWLIST

JMSCS0021 = A(z) ''{0}'' enged\u00e9lyez\u00e9si lista f\u00e1jlt nem lehet megnyitni
JMSCS0021.inserts = XMSC_ALLOWLIST

JMSCS0022 = A(z) ''{0}'' enged\u00e9lyez\u00e9si lista f\u00e1jl m\u00e1r l\u00e9tezik, \u00e9s nem lehet fel\u00fcl\u00edrni
JMSCS0022.inserts = XMSC_ALLOWLIST

JMSCS0023 = A(z) ''{0}'' enged\u00e9lyez\u00e9si list\u00e1ban \u00e9rv\u00e9nytelen bejegyz\u00e9s tal\u00e1lhat\u00f3
JMSCS0023.inserts = XMSC_ALLOWLIST

JMSCS0024 = Az enged\u00e9lyez\u00e9si lista f\u00e1jl nem \u00edrhat\u00f3

JMSCS0025 = Az enged\u00e9lyez\u00e9si lista ALKALMAZ\u00c1SA aktiv\u00e1lva van - a(z) ''{0}'' enged\u00e9lyez\u00e9si lista f\u00e1jl \u00e9ppen haszn\u00e1latban van az ObjectMessage soros\u00edt\u00e1s \u00e9s soros\u00edt\u00e1s visszavon\u00e1sa m\u0171veletek \u00e9rv\u00e9nyes\u00edt\u00e9s\u00e9hez - az enged\u00e9lyez\u00e9si lista fa: {1}''
JMSCS0025.inserts = XMSC_ALLOWLIST,XMSC_ALLOWLIST_CONTENTS

JMSCS0026 = Az enged\u00e9lyez\u00e9si lista FELT\u00c9RK\u00c9PEZ\u00c9S aktiv\u00e1lva van - A(z) ''{0}'' enged\u00e9lyez\u00e9si lista f\u00e1jl \u00e9ppen haszn\u00e1latban van az ObjectMessage soros\u00edt\u00e1s \u00e9s soros\u00edt\u00e1s visszavon\u00e1sa m\u0171veletek feljegyz\u00e9s\u00e9re
JMSCS0026.inserts = XMSC_ALLOWLIST

JMSCS0027 = Az enged\u00e9lyez\u00e9si lista ALKALMAZ\u00c1SA aktiv\u00e1lva van - a(z) ''{0}'' enged\u00e9lyez\u00e9si lista f\u00e1jl \u00e9ppen haszn\u00e1latban van az ObjectMessage soros\u00edt\u00e1s \u00e9s soros\u00edt\u00e1s visszavon\u00e1sa m\u0171veletek \u00e9rv\u00e9nyes\u00edt\u00e9s\u00e9hez
JMSCS0027.inserts = XMSC_ALLOWLIST

JMSCS0028 = Enged\u00e9lyez\u00e9si lista FELT\u00c9RK\u00c9PEZ\u00c9SI k\u00e9r\u00e9s \u00e9rkezett, de a(z) ''{0}'' nev\u0171 enged\u00e9lyez\u00e9si lista f\u00e1jl nem f\u00e1jl URI
JMSCS0028.inserts = XMSC_ALLOWLIST

JMSCS0029 = Nincs aktiv\u00e1lva enged\u00e9lyez\u00e9si lista funkcionalit\u00e1s - vagy a tulajdons\u00e1gok nem lettek be\u00e1ll\u00edtva, vagy a biztons\u00e1gi enged\u00e9lyek miatt azok nem olvashat\u00f3k

JMSCS0030 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem rendelkezik enged\u00e9llyel a(z) ''{0}'' f\u00e1jl nyomk\u00f6vet\u00e9s\u00e9hez a(z) ''{1}'' k\u00f6nyvt\u00e1rban
JMSCS0030.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME 

JMSCS0031 = Kiv\u00e9tel t\u00f6rt\u00e9nt a(z) ''{0}'' nyomk\u00f6vet\u00e9si f\u00e1jl \u00edr\u00e1s\u00e1ra tett k\u00eds\u00e9rlet sor\u00e1n a(z) ''{1}'' nyomk\u00f6vet\u00e9si k\u00f6nyvt\u00e1rban. A kiv\u00e9tel a k\u00f6vetkez\u0151: ''{2}''
JMSCS0031.inserts = XMSC_TRACE_FILE_NAME, XMSC_TRACE_DIRECTORY_NAME, XMSC_EXCEPTION

JMSCS0032 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta inicializ\u00e1lni a(z) ''{0}'' nyomk\u00f6vet\u00e9si f\u00e1jlt a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: ''{1}''. A nyomk\u00f6vet\u00e9s a szabv\u00e1nyos rendszerkimenetre lesz ki\u00edrva. 
JMSCS0032.inserts = XMSC_TRACE_FILE_NAME, XMSC_EXCEPTION

JMSCS0033 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta l\u00e9trehozni a nyomk\u00f6vet\u00e9st a rendszer alap\u00e9rtelmezett hely\u00e9n: ''{0}''
JMSCS0033.inserts = XMSC_TRACE_FILE_NAME

JMSCS0034 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta l\u00e9trehozni a nyomk\u00f6vet\u00e9st a megadott helyen: ''{0}''
JMSCS0034.inserts = XMSC_TRACE_FILE_NAME

JMSCS0035 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta l\u00e9trehozni a nyomk\u00f6vet\u00e9st a jelenlegi helyen: ''{0}''
JMSCS0035.inserts = XMSC_TRACE_FILE_NAME

JMSCS0036 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta \u00e9rtelmezni a k\u00f6vetkez\u0151 keres\u00e9si karaktersorozatot: ''{0}''
JMSCS0036.inserts = XMSC_SEARCH_STRING

JMSCS0037 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta p\u00e9ld\u00e1nyos\u00edtani a k\u00f6vetkez\u0151 TraceHandler-t: ''{0}''
JMSCS0037.inserts = XMSC_HANDLER_NAME

JMSCS0038 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta p\u00e9ld\u00e1nyos\u00edtani a k\u00f6vetkez\u0151 TraceFormatter-t: ''{0}''
JMSCS0038.inserts = XMSC_FORMATTER_NAME

JMSCS0039 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa nem tudta \u00edrni a k\u00f6vetkez\u0151 FFDC-t: ''{0}''
JMSCS0039.inserts = XMSC_FDC_NAME

JMSCS0040 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa a k\u00f6vetkez\u0151re v\u00e9gez nyomk\u00f6vet\u00e9st: ''{0}''
JMSCS0040.inserts = XMSC_TRACE_FILE_NAME

JMSCS0041 = A(z) IBM MQ \u00fczenetkezel\u00e9si \u00fcgyf\u00e9l nyomk\u00f6vet\u00e9si mechanizmusa a konzolra v\u00e9gez nyomk\u00f6vet\u00e9st

JMSCS0042 = A(z) ''{0}'' tulajdons\u00e1g \u00e9rt\u00e9ke ''{1}''
JMSCS0042.inserts = XMSC_PROPERTY_NAME, XMSC_PROPERTY_VALUE 

JMSCS0043 = Sz\u00fcl\u0151 hconn (''{0}'') \u00fajracsatlakoztat\u00e1s\u00e1nak sorba \u00e1ll\u00edt\u00e1sa a(z) ''{1}'' sorkezel\u0151h\u00f6z
JMSCS0043.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER

JMSCS0044 = Sz\u00fcl\u0151 hconn (''{0}'') \u00fajracsatlakoztat\u00e1s\u00e1nak ind\u00edt\u00e1sa a(z) ''{1}'' sorkezel\u0151h\u00f6z
JMSCS0044.inserts = XMSC_HCONN, XMSC_QUEUE_MANAGER
JMSCS0044.explanation = Elindult egy \u00fajrakapcsol\u00f3d\u00e1s, vagy egy egys\u00e9ges f\u00fcrt (nem null\u00e9rt\u00e9k\u0171 sorkezel\u0151n\u00e9v) k\u00e9r\u00e9s\u00e9re, vagy kapcsolati hiba miatt.
JMSCS0044.useraction = Nem sz\u00fcks\u00e9ges.

JMSCS0045 = Sz\u00fcl\u0151 hconn (''{0}'') \u00fajracsatlakoztat\u00e1s\u00e1nak megszak\u00edt\u00e1sa
JMSCS0045.inserts = XMSC_HCONN

JMSCS0046 = Sz\u00fcl\u0151 hconn (''{0}'') \u00fajracsatlakoztat\u00e1s\u00e1nak \u00fajra\u00fctemez\u00e9se
JMSCS0046.inserts = XMSC_HCONN
JMSCS0046.explanation = Az \u00fajrakapcsol\u00f3d\u00e1s meghi\u00fasult, a rendszer k\u00e9s\u0151bb \u00fajra megpr\u00f3b\u00e1lja. 
JMSCS0046.useraction = Nem sz\u00fcks\u00e9ges.

JMSCS0047 = Sz\u00fcl\u0151 hconn (''{0}'') \u00fajracsatlakoztat\u00e1sa befejez\u0151d\u00f6tt
JMSCS0047.inserts = XMSC_HCONN

JMSCS0048 = Lesz\u00e1rmazott hconn (''{0}'') \u00fajracsatlakoztat\u00e1s\u00e1nak ind\u00edt\u00e1sa
JMSCS0048.inserts = XMSC_HCONN

JMSCS0049 = Lesz\u00e1rmazott hconn (''{0}'') \u00fajracsatlakoztat\u00e1sa sikertelen
JMSCS0049.inserts = XMSC_HCONN

JMSCS0050 = Lesz\u00e1rmazott hconn (''{0}'') \u00fajracsatlakoztat\u00e1sa befejez\u0151d\u00f6tt
JMSCS0050.inserts = XMSC_HCONN

JMSCS0051 = A sz\u00fcl\u0151 hconn ''{0}'' m\u00e1r nem csatlakoztathat\u00f3 \u00fajra
JMSCS0051.inserts = XMSC_HCONN

JMSCS0052 = A sz\u00fcl\u0151 hconn ''{0}'' \u00fajracsatlakoz\u00e1si ideje lej\u00e1rt
JMSCS0052.inserts = XMSC_HCONN

JMSCS0053 = \u00dajracsatlakoz\u00e1si id\u0151 (ezredm\u00e1sodperc) : ''{0}''
JMSCS0053.inserts = XMSC_RECONNECTION_TIMES

JMSCS0054 = A sz\u00fcl\u0151 hconn ''{0}'' \u00fajracsatlakoz\u00e1si k\u00e9r\u00e9se figyelmen k\u00edv\u00fcl marad, mert a hconn nem \u00e1ll k\u00e9szen az \u00fajracsatlakoz\u00e1sra
JMSCS0054.inserts = XMSC_HCONN

